jnzim/stm32l476-baremetal-blinky/src/sysid/foc_sysid.c
// foc_sysid.c — system identification mode FOC
//
// Extracted from main.c (jz-f411). Logic unchanged from working sysid firmware.
// Added: FOC_SYSID_CL_STEP test mode for closed-loop current step response.
//        FOC_SYSID_CL_VEL_STEP test mode for closed-loop velocity step response.
//
// Internal test selected by SYSID_TEST in config.h:
//   SYSID_TEST_CHIRP        — OL Vd chirp sweep (proven, existing)
//   SYSID_TEST_CL_STEP      — CL iq step, current loop closed, logs iq_ref/iq_meas
//   SYSID_TEST_CL_VEL_STEP  — CL velocity step, velocity loop closed
//                             sysid_f_Hz slot  → vel_cmd  [mrad/s]  Python: val/1000.0
//                             iq_cmd_mA slot   → vel_meas [counts/s] Python: val*(2pi/8192)

#include "stm32f4xx.h"
#include "foc_sysid.h"
#include "config.h"
#include "encoder.h"
#include "current_feedback.h"
#include "pwm.h"
#include "loops.h"
#include "spi.h"

#include <math.h>
#include <stdint.h>
#include <stdbool.h>


// =============================================================================
// Alignment stage
// =============================================================================

typedef enum
{
    SYSID_STAGE_ALIGN = 0,
    SYSID_STAGE_RUN,
    SYSID_STAGE_IDLE
} SysidStage;

static SysidStage   sysid_stage             = SYSID_STAGE_ALIGN;
static uint32_t     sysid_align_tick        = 0;
static uint32_t     sysid_discharge_tick    = 0;
static int32_t      sysid_enc_offset        = 0;
static uint32_t     vel_chirp_settle_tick   = 0;

// =============================================================================
// Chirp state
// =============================================================================

static float sysid_t            = 0.0f;
static float chirp_angle_rad    = 0.0f;
static float sysid_f            = SYSID_F_START;

// =============================================================================
// CL step state
// =============================================================================

#define CL_STEP_AMPLITUDE       0.28f        // A
#define CL_STEP_VEL_AMPLITUDE   10.0       // rad/s
#define CL_STEP_HOLD_TICKS      5000u       
#define CL_STEP_SETTLE_TICKS    1000u     

// Was 20000 (4.0s @ the 5kHz decimated vel-loop rate) for no real reason --
// loops_reset() already zeroes every PI state at the ALIGN->RUN transition,
// and real current is already at genuine zero by then too (see the align
// discharge phase). The only actual constraint is encoder_get_velocity()'s
// 80-sample moving-average filter (VEL_FILTER_N in encoder.c) needing to
// fill before vel_meas_counts is trustworthy -- 80 samples @ 20kHz = 4ms =
// 20 ticks @ the 5kHz decimated rate this counter runs at. Any more than
// that just gives a persistent current bias more time to wind up the
// d-axis integrator before the real test signal starts, for no benefit.
//
// Named CL_-specific and kept separate from VEL_CHIRP_SETTLE_TICKS
// (config.h) on purpose -- run_cl_vel_chirp()'s settle counter runs at this
// 5kHz-decimated rate, but run_vel_chirp()'s (the open-loop test) runs on
// the raw undecimated 20kHz tick. Sharing one constant between them
// silently broke the open-loop test's settle time (4ms instead of ~1s)
// when this one got tuned down for the closed-loop context.
#define CL_VEL_CHIRP_SETTLE_TICKS  20u

typedef enum
{
    CL_STEP_SETTLE = 0,
    CL_STEP_HIGH,
    CL_STEP_LOW,
    CL_STEP_ZERO,
    CL_STEP_DONE
} ClStepPhase;

static ClStepPhase cl_step_phase = CL_STEP_SETTLE;
static uint32_t    cl_step_tick  = 0;

// =============================================================================
// Shared measured values (written each ISR, read by spi_sysid_update_latest)
// =============================================================================

static float ia_meas  = 0.0f;
static float ib_meas  = 0.0f;
static float ic_meas  = 0.0f;
static float i_d_meas = 0.0f;
static float i_q_meas = 0.0f;

static float foc_vd_applied = 0.0f;
static float foc_vq_applied = 0.0f;

// Velocity step telemetry
// vel_cmd_rad_sec is defined in loops.c, declared extern in loops.h
static float vel_meas_counts = 0.0f;   // measured velocity [counts/s] — raw from encoder


// =============================================================================
// foc_theta_from_encoder — electrical angle relative to alignment offset
// =============================================================================

static float foc_theta_from_encoder(void)
{
    int32_t raw = encoder_get_position() - sysid_enc_offset;

    float theta_mech = (float)raw * (FOC_TWO_PI / ENCODER_CPR);
    float theta_elec = ENC_DIR * theta_mech * (float)MOTOR_POLE_PAIRS;

    theta_elec = fmodf(theta_elec, FOC_TWO_PI);
    if (theta_elec < 0.0f)
        theta_elec += FOC_TWO_PI;

    return theta_elec;
}


// =============================================================================
// run_voltage_test
// =============================================================================

static void run_voltage_test(void)
{
    pwm_apply_phase_volts(0.5f, -0.25f, -0.25f);

    sysid_t += SYSID_DT;

    if (sysid_t >= 30.0f)
    {
        pwm_apply_phase_volts(0.0f, 0.0f, 0.0f);
        sysid_stage = SYSID_STAGE_IDLE;
    }
}


// =============================================================================
// run_current_test
// =============================================================================

static void run_current_test(void)
{
    current_feedback_get_phase_amps(&ia_meas, &ib_meas, &ic_meas);

    pwm_apply_phase_volts(0.5f, -0.25f, -0.25f);

    sysid_t += SYSID_DT;

    if (sysid_t >= 1.0f)
    {
        pwm_apply_phase_volts(0.0f, 0.0f, 0.0f);
        sysid_stage = SYSID_STAGE_IDLE;
    }
}


// =============================================================================
// run_chirp — Open current loop chirp. Input is Vq, measure Iq for f analysis
// =============================================================================

static void run_current_lp_chirp(void)
{
    sysid_f = SYSID_F_START * powf(SYSID_F_END / SYSID_F_START, sysid_t / SYSID_DURATION);

