jnzim/stm32l476-baremetal-blinky/src/sysid/foc_sysid.c
    chirp_angle_rad += FOC_TWO_PI * sysid_f * SYSID_DT;
    if (chirp_angle_rad >= FOC_TWO_PI)
        chirp_angle_rad -= FOC_TWO_PI;

    foc_vq_applied = SYSID_AMPLITUDE * sinf(chirp_angle_rad);
    foc_vd_applied = 0.0f;

    pwm_apply_dq(foc_vd_applied, foc_vq_applied, 0.0f);

    current_feedback_get_dq(0.0f, &i_d_meas, &i_q_meas);

    sysid_t += SYSID_DT;
    if (sysid_t >= SYSID_DURATION)
    {
        sysid_stage = SYSID_STAGE_IDLE;
    }
}


// =============================================================================
// run_cl_current_chirp — CLOSED current loop chirp: sweeps iq_cmd (not Vq)
// with the current PI closed around it, to directly measure the closed-loop
// response H(s) = iq_meas/iq_cmd and back out the loop's real open-loop
// margin via L = H/(1-H) -- exact algebra, no assumption that C(s) is the
// linear Kp+Ki/s it's designed to be. bode_plot.py's method (measure the
// bare electrical plant open-loop, then combine it with the *assumed*
// linear C(s)) was shown on the velocity loop to disagree with a real
// closed-loop measurement by 37% on crossover frequency, most likely from
// saturation -- this test exists to get the current loop's real margin the
// same trustworthy way, not repeat that assumption here too.
//
// Velocity loop plays no part in this test: iq_cmd is driven directly by
// the chirp, same as run_current_lp_chirp's open-loop version -- the only
// difference is that reference now goes through the closed current PI
// instead of driving Vq directly.
//
// Telemetry slot usage:
//   sysid_f_Hz slot -> iq_cmd * 1000  [mA]
//   iq_cmd_mA slot  -> iq_meas (i_q_meas, already logged natively) [mA]
// =============================================================================

static float cl_current_chirp_t         = 0.0f;
static float cl_current_chirp_angle_rad = 0.0f;

static void run_cl_current_chirp(void)
{
    float theta = foc_theta_from_encoder();

    if (!current_feedback_sample_valid()) { return; }

    current_feedback_get_phase_amps(&ia_meas, &ib_meas, &ic_meas);
    current_feedback_get_dq(theta, &i_d_meas, &i_q_meas);

    if (vel_chirp_settle_tick < CL_CURRENT_CHIRP_SETTLE_TICKS)
    {
        iq_cmd = 0.0f;
        ++vel_chirp_settle_tick;
    }
    else
    {
        sysid_f = CL_CURRENT_CHIRP_F_START *
                  powf(CL_CURRENT_CHIRP_F_END / CL_CURRENT_CHIRP_F_START,
                       cl_current_chirp_t / CL_CURRENT_CHIRP_DURATION);

        cl_current_chirp_angle_rad += FOC_TWO_PI * sysid_f * SYSID_DT;
        if (cl_current_chirp_angle_rad >= FOC_TWO_PI)
            cl_current_chirp_angle_rad -= FOC_TWO_PI;

        // sinf, not cosf -- continuous with the settle phase's iq_cmd=0.0f
        // hold, same reasoning as run_cl_vel_chirp.
        iq_cmd = CL_CURRENT_CHIRP_AMPLITUDE * sinf(cl_current_chirp_angle_rad);

        cl_current_chirp_t += SYSID_DT;

        if (cl_current_chirp_t >= CL_CURRENT_CHIRP_DURATION)
        {
            iq_cmd         = 0.0f;
            foc_vd_applied = 0.0f;
            foc_vq_applied = 0.0f;
            pwm_apply_dq(0.0f, 0.0f, theta);
            sysid_stage = SYSID_STAGE_IDLE;
            return;
        }
    }

    foc_vd_applied = pi_step(&d_current_loop, 0.0f - i_d_meas, SYSID_DT);
    foc_vq_applied = pi_step(&current_loop, iq_cmd - i_q_meas, SYSID_DT);

    pwm_apply_dq(foc_vd_applied, foc_vq_applied, theta);
}


// =============================================================================
// run_vel_chirp — CL iq chirp for mechanical plant identification
// =============================================================================

static void run_vel_chirp(void)
{
    
    const float theta = foc_theta_from_encoder();

    if (!current_feedback_sample_valid()) { return; }

    current_feedback_get_phase_amps(&ia_meas, &ib_meas, &ic_meas);
    current_feedback_get_dq(theta, &i_d_meas, &i_q_meas);

    if (vel_chirp_settle_tick < VEL_CHIRP_SETTLE_TICKS)
    {
        if (vel_chirp_settle_tick == 0u)
        {
            // P-only current loop for this test -- Ki=5561's integrator
            // winding up then unwinding is exactly what produced the
            // ringing (instant spike, then ~15-tick decaying oscillation)
            // seen after a real stick-slip disturbance. Same Kp as
            // everywhere else (loops.c), Ki=0 so the measured response
            // reflects the raw electrical/mechanical plant directly instead
            // of the controller's own dynamics on top of it. Scoped to just
            // this test -- current_loop/d_current_loop are shared globals,
            // loops_reset() puts the real Ki back at the next ALIGN->RUN.
            pi_init(&current_loop,   3.86f, 0.0f, -(V_BUS / 2.0f), (V_BUS / 2.0f));
            pi_init(&d_current_loop, 3.86f, 0.0f, -(V_BUS / 2.0f), (V_BUS / 2.0f));
        }

        // Settle onto the bias current itself, not zero -- so the stage is
        // already moving at the bias's steady-state kinetic speed before the
        // chirp starts, instead of stepping onto the bias at t=0 of the sweep.
        float i_cmd = 0;

        foc_vd_applied = pi_step(&d_current_loop, 0.0f - i_d_meas, SYSID_DT);
        foc_vq_applied = pi_step(&current_loop, i_cmd - i_q_meas, SYSID_DT);

        pwm_apply_dq(foc_vd_applied, foc_vq_applied, theta);

        ++vel_chirp_settle_tick;
        return;
    }


    sysid_f = VEL_CHIRP_F_START * powf(VEL_CHIRP_F_END / VEL_CHIRP_F_START, sysid_t / VEL_CHIRP_DURATION);

    chirp_angle_rad += FOC_TWO_PI * sysid_f * SYSID_DT;
    if (chirp_angle_rad >= FOC_TWO_PI)
    {
        chirp_angle_rad -= FOC_TWO_PI;
    }
    iq_cmd = VEL_CHIRP_AMPLITUDE * cosf(chirp_angle_rad);
    if (iq_cmd >  VEL_CHIRP_IQ_LIMIT) iq_cmd =  VEL_CHIRP_IQ_LIMIT;
    if (iq_cmd < -VEL_CHIRP_IQ_LIMIT) iq_cmd = -VEL_CHIRP_IQ_LIMIT;

    foc_vd_applied = pi_step(&d_current_loop, 0.0f - i_d_meas, SYSID_DT);
    foc_vq_applied = pi_step(&current_loop, iq_cmd - i_q_meas, SYSID_DT);

    pwm_apply_dq(foc_vd_applied, foc_vq_applied, theta);

    sysid_t += SYSID_DT;

    if (sysid_t >= VEL_CHIRP_DURATION)
    {
        iq_cmd         = 0.0f;
        foc_vd_applied = 0.0f;
        foc_vq_applied = 0.0f;
        pwm_apply_dq(0.0f, 0.0f, theta);
        loops_reset();
        sysid_stage = SYSID_STAGE_IDLE;
    }
}


