jnzim/stm32l476-baremetal-blinky/src/sysid/foc_sysid.c
// =============================================================================
// run_cl_step — Closed current loop step input (set CL_STEP_HIGH )
// =============================================================================

static void run_cl_current_step(void)
{

    float theta = foc_theta_from_encoder();

    if (!current_feedback_sample_valid())
        return;

    current_feedback_get_phase_amps(&ia_meas, &ib_meas, &ic_meas);
    current_feedback_get_dq(theta, &i_d_meas, &i_q_meas);
    vel_meas_counts = encoder_get_velocity();  // ADD HERE

    switch (cl_step_phase)
    {
        case CL_STEP_SETTLE:
            iq_cmd = 0.0f;
            if (++cl_step_tick >= CL_STEP_SETTLE_TICKS)
            {
                cl_step_tick  = 0;
                cl_step_phase = CL_STEP_HIGH;
            }
            break;

        case CL_STEP_HIGH:
            iq_cmd = CL_STEP_AMPLITUDE;
            if (++cl_step_tick >= CL_STEP_HOLD_TICKS)
            {
                cl_step_tick  = 0;
                cl_step_phase = CL_STEP_LOW;
            }
            break;

        case CL_STEP_LOW:
            iq_cmd = -1.0f * CL_STEP_AMPLITUDE;
            if (++cl_step_tick >= CL_STEP_HOLD_TICKS)
            {
                cl_step_tick  = 0;
                cl_step_phase = CL_STEP_ZERO;
            }
            break;

        case CL_STEP_ZERO:
            iq_cmd = 0.0f;
            if (++cl_step_tick >= CL_STEP_HOLD_TICKS)
            {
                cl_step_tick  = 0;
                cl_step_phase = CL_STEP_DONE;
                sysid_stage   = SYSID_STAGE_IDLE;
            }
            break;

        case CL_STEP_DONE:
        default:
            iq_cmd         = 0.0f;
            foc_vd_applied = 0.0f;
            foc_vq_applied = 0.0f;
            pwm_apply_dq(0.0f, 0.0f, theta);
            return;
    }

    foc_vd_applied = pi_step(&d_current_loop, 0.0f - i_d_meas, SYSID_DT);
    foc_vq_applied = pi_step(&current_loop, iq_cmd - i_q_meas, SYSID_DT);

    pwm_apply_dq(foc_vd_applied, foc_vq_applied, theta);
}


// =============================================================================
// run_cl_vel_step — CL velocity loop step response
//
// Architecture:
//   Outer loop (velocity): runs every 4th ISR tick = 5 kHz (DT_VELOCITY)
//     vel_cmd → [vel PI] → iq_cmd  [A]
//   Inner loop (current): runs every ISR tick = 20 kHz (SYSID_DT)
//     iq_cmd  → [cur PI] → vq_applied  [V]
//
// Telemetry slot usage:
//   sysid_f_Hz slot → vel_cmd_rad_sec * 1000  [mrad/s]
//                      Python: df["sysid_f"] / 1000.0  → rad/s
//   iq_cmd_mA slot  → vel_meas_counts          [counts/s, int16]
//                      Python: df["iq_cmd_mA"] * (2*pi / 8192)  → rad/s
// =============================================================================

#define VEL_LOOP_DECIMATE  4u   // 20 kHz / 4 = 5 kHz

static uint32_t vel_loop_tick = 0;
static void run_cl_vel_step(void)
{
    float theta = foc_theta_from_encoder();

    if (!current_feedback_sample_valid()) { return; }

    current_feedback_get_phase_amps(&ia_meas, &ib_meas, &ic_meas);
    current_feedback_get_dq(theta, &i_d_meas, &i_q_meas);

    vel_meas_counts = encoder_get_velocity();   // counts/s, stored for telemetry

    // ── Outer velocity loop — 5 kHz ──────────────────────────────────────────
    if (++vel_loop_tick >= VEL_LOOP_DECIMATE)
    {
        vel_loop_tick = 0;

        float vel_meas_rad = vel_meas_counts * (FOC_TWO_PI / ENCODER_CPR);

        switch (cl_step_phase)
        {
            case CL_STEP_SETTLE:
                vel_cmd_rad_sec = 0.0f;
                if (++cl_step_tick >= CL_STEP_SETTLE_TICKS)
                {
                    cl_step_tick             = 0;
                    cl_step_phase            = CL_STEP_HIGH;
                    velocity_loop.integrator = 0.0f;  // clear vel integrator only
                }
                break;

            case CL_STEP_HIGH:
                vel_cmd_rad_sec = CL_STEP_VEL_AMPLITUDE;
                if (++cl_step_tick >= CL_STEP_HOLD_TICKS)
                {
                    cl_step_tick  = 0;
                    cl_step_phase = CL_STEP_LOW;
                }
                break;

            case CL_STEP_LOW:
                vel_cmd_rad_sec = -1.0f * CL_STEP_VEL_AMPLITUDE;
                if (++cl_step_tick >= CL_STEP_HOLD_TICKS)
                {
                    cl_step_tick  = 0;
                    cl_step_phase = CL_STEP_ZERO;
                }
                break;

            case CL_STEP_ZERO:
                vel_cmd_rad_sec = 0.0f;
                if (++cl_step_tick >= CL_STEP_HOLD_TICKS)
                {
                    cl_step_tick  = 0;
                    cl_step_phase = CL_STEP_DONE;
                    sysid_stage   = SYSID_STAGE_IDLE;
                }
                break;

            case CL_STEP_DONE:
            default:
                vel_cmd_rad_sec = 0.0f;
                iq_cmd          = 0.0f;
                foc_vd_applied  = 0.0f;
                foc_vq_applied  = 0.0f;
                pwm_apply_dq(0.0f, 0.0f, theta);
                return;
        }

        // Velocity PI → iq_cmd [A], clamped to ±0.5A
        iq_cmd = pi_step(&velocity_loop, vel_cmd_rad_sec - vel_meas_rad, DT_VELOCITY);
    }

    // ── Inner current loop — 20 kHz ──────────────────────────────────────────
    foc_vd_applied = pi_step(&d_current_loop, 0.0f - i_d_meas, SYSID_DT);
    foc_vq_applied = pi_step(&current_loop, iq_cmd - i_q_meas, SYSID_DT);

    pwm_apply_dq(foc_vd_applied, foc_vq_applied, theta);
}


// ============================================= ================================
// run_cl_vel_chirp — CLOSED velocity loop chirp: sweeps vel_cmd (not iq)
// with the velocity PI closed around it, to identify the closed-loop
// vel_cmd -> vel_meas response for designing the outer position P
// controller. Same cascade as run_cl_vel_step(), chirp instead of a step.
//
// Telemetry slot usage — same convention as CL_VEL_STEP:
//   sysid_f_Hz slot → vel_cmd_rad_sec * 1000  [mrad/s]
//   iq_cmd_mA slot  → vel_meas_counts          [counts/s, int16]
// =============================================================================

static float cl_vel_chirp_t         = 0.0f;
static float cl_vel_chirp_angle_rad = 0.0f;

static void run_cl_vel_chirp(void)
{
    float theta = foc_theta_from_encoder();

    if (!current_feedback_sample_valid()) { return; }

    current_feedback_get_phase_amps(&ia_meas, &ib_meas, &ic_meas);
    current_feedback_get_dq(theta, &i_d_meas, &i_q_meas);

    vel_meas_counts = encoder_get_velocity();

