jnzim/stm32l476-baremetal-blinky/src/sysid/foc_sysid.c
    if (++vel_loop_tick >= VEL_LOOP_DECIMATE)
    {
        vel_loop_tick = 0;

        float vel_meas_rad = vel_meas_counts * (FOC_TWO_PI / ENCODER_CPR);

        if (vel_chirp_settle_tick < CL_VEL_CHIRP_SETTLE_TICKS)
        {
            vel_cmd_rad_sec = 0.0f;
            ++vel_chirp_settle_tick;
        }
        else
        {
            sysid_f = CL_VEL_CHIRP_F_START *
                      powf(CL_VEL_CHIRP_F_END / CL_VEL_CHIRP_F_START,
                           cl_vel_chirp_t / CL_VEL_CHIRP_DURATION);

            cl_vel_chirp_angle_rad += FOC_TWO_PI * sysid_f * DT_VELOCITY;
            if (cl_vel_chirp_angle_rad >= FOC_TWO_PI)
                cl_vel_chirp_angle_rad -= FOC_TWO_PI;

            // sinf, not cosf -- starts at 0 so this is continuous with the
            // settle phase's vel_cmd_rad_sec=0.0f hold. cosf(0)=1 would step
            // the full CL_VEL_CHIRP_AMPLITUDE instantly the moment settle
            // ends, with current already closed-loop and reacting live.
            vel_cmd_rad_sec = CL_VEL_CHIRP_AMPLITUDE * sinf(cl_vel_chirp_angle_rad);

            cl_vel_chirp_t += DT_VELOCITY;

            if (cl_vel_chirp_t >= CL_VEL_CHIRP_DURATION)
            {
                vel_cmd_rad_sec = 0.0f;
                iq_cmd          = 0.0f;
                foc_vd_applied  = 0.0f;
                foc_vq_applied  = 0.0f;
                pwm_apply_dq(0.0f, 0.0f, theta);
                loops_reset();
                sysid_stage = SYSID_STAGE_IDLE;
                return;
            }
        }

        iq_cmd = pi_step(&velocity_loop, vel_cmd_rad_sec - vel_meas_rad, DT_VELOCITY);
    }

    foc_vd_applied = pi_step(&d_current_loop, 0.0f - i_d_meas, SYSID_DT);
    foc_vq_applied = pi_step(&current_loop, iq_cmd - i_q_meas, SYSID_DT);

    pwm_apply_dq(foc_vd_applied, foc_vq_applied, theta);
}


// =============================================================================
// run_position_step — position P loop step response, wrapped around the
// already-closed velocity + current loops (position_loop.kp = POSITION_LOOP_KP,
// designed from the closed-velocity-loop chirp -- see foc-sysid
// closed_vel_bode_plot.py).
//
// Cascade:
//   Position loop (1 kHz, DT_POSITION):  pos_cmd -> [P]      -> vel_cmd
//   Velocity loop (5 kHz, DT_VELOCITY):  vel_cmd -> [vel PI] -> iq_cmd
//   Current loop  (20 kHz, SYSID_DT):    iq_cmd  -> [cur PI] -> vq_applied
//
// Reuses cl_step_phase/cl_step_tick (same SETTLE/HIGH/LOW/ZERO/DONE sequence
// as the other step tests) with pos_cmd_rad in place of iq/vel command.
//
// Telemetry slot usage:
//   sysid_f_Hz slot -> pos_cmd_rad  * 1000  [mrad]
//   iq_cmd_mA slot  -> pos_meas_rad * 1000  [mrad]
// =============================================================================

#define POS_LOOP_DECIMATE  20u   // 20 kHz / 20 = 1 kHz = DT_POSITION

static uint32_t pos_loop_tick   = 0;
static float    pos_cmd_rad     = 0.0f;
static float    pos_meas_rad    = 0.0f;

static void run_position_step(void)
{
    float theta = foc_theta_from_encoder();

    if (!current_feedback_sample_valid()) { return; }

    current_feedback_get_phase_amps(&ia_meas, &ib_meas, &ic_meas);
    current_feedback_get_dq(theta, &i_d_meas, &i_q_meas);

    vel_meas_counts = encoder_get_velocity();

    // ── Position loop — 1 kHz ────────────────────────────────────────────────
    if (++pos_loop_tick >= POS_LOOP_DECIMATE)
    {
        pos_loop_tick = 0;

        int32_t raw = encoder_get_position() - sysid_enc_offset;
        pos_meas_rad = (float)raw * (FOC_TWO_PI / ENCODER_CPR);

        switch (cl_step_phase)
        {
            case CL_STEP_SETTLE:
                pos_cmd_rad = 0.0f;
                if (++cl_step_tick >= POSITION_STEP_SETTLE_TICKS)
                {
                    cl_step_tick  = 0;
                    cl_step_phase = CL_STEP_HIGH;
                }
                break;

            case CL_STEP_HIGH:
                pos_cmd_rad = POSITION_STEP_AMPLITUDE_RAD;
                if (++cl_step_tick >= POSITION_STEP_HOLD_TICKS)
                {
                    cl_step_tick  = 0;
                    cl_step_phase = CL_STEP_LOW;
                }
                break;

            case CL_STEP_LOW:
                pos_cmd_rad = -POSITION_STEP_AMPLITUDE_RAD;
                if (++cl_step_tick >= POSITION_STEP_HOLD_TICKS)
                {
                    cl_step_tick  = 0;
                    cl_step_phase = CL_STEP_ZERO;
                }
                break;

            case CL_STEP_ZERO:
                pos_cmd_rad = 0.0f;
                if (++cl_step_tick >= POSITION_STEP_HOLD_TICKS)
                {
                    cl_step_tick  = 0;
                    cl_step_phase = CL_STEP_DONE;
                    sysid_stage   = SYSID_STAGE_IDLE;
                }
                break;

            case CL_STEP_DONE:
            default:
                vel_cmd_rad_sec = 0.0f;
                iq_cmd          = 0.0f;
                foc_vd_applied  = 0.0f;
                foc_vq_applied  = 0.0f;
                pwm_apply_dq(0.0f, 0.0f, theta);
                return;
        }

        // P controller has no built-in output clamp (unlike PIState) -- clamp
        // the velocity demand manually so a step doesn't ask for more speed
        // than we've actually validated.
        vel_cmd_rad_sec = p_step(&position_loop, pos_cmd_rad - pos_meas_rad);
        if (vel_cmd_rad_sec >  POSITION_VEL_LIMIT) vel_cmd_rad_sec =  POSITION_VEL_LIMIT;
        if (vel_cmd_rad_sec < -POSITION_VEL_LIMIT) vel_cmd_rad_sec = -POSITION_VEL_LIMIT;
    }

    // ── Velocity loop — 5 kHz ────────────────────────────────────────────────
    if (++vel_loop_tick >= VEL_LOOP_DECIMATE)
    {
        vel_loop_tick = 0;
        float vel_meas_rad = vel_meas_counts * (FOC_TWO_PI / ENCODER_CPR);
        iq_cmd = pi_step(&velocity_loop, vel_cmd_rad_sec - vel_meas_rad, DT_VELOCITY);
    }

    // ── Current loop — 20 kHz ────────────────────────────────────────────────
    foc_vd_applied = pi_step(&d_current_loop, 0.0f - i_d_meas, SYSID_DT);
    foc_vq_applied = pi_step(&current_loop, iq_cmd - i_q_meas, SYSID_DT);

    pwm_apply_dq(foc_vd_applied, foc_vq_applied, theta);
}


