jnzim/stm32l476-baremetal-blinky/src/sysid/foc_sysid.c
// =============================================================================
// run_cl_pos_chirp — CLOSED position loop chirp: sweeps pos_cmd with the
// full P -> PI -> PI cascade closed, to directly MEASURE the actual
// closed-loop response of the whole system (pos_meas/pos_cmd) instead of
// relying on the H(s)/s construction used to design POSITION_LOOP_KP.
//
// Cascade: identical to run_position_step() -- position P (1kHz) ->
// velocity PI (5kHz) -> current PI (20kHz). Reuses pos_loop_tick,
// pos_cmd_rad, pos_meas_rad from run_position_step() above (mutually
// exclusive via SYSID_TEST dispatch, so no conflict).
//
// Telemetry: shares the SYSID_TEST_POSITION_STEP slot convention
//   sysid_f_Hz slot -> pos_cmd_rad  * 1000  [mrad]
//   iq_cmd_mA slot  -> pos_meas_rad * 1000  [mrad]
// plus vel_cmd/vel_meas repurposed into the enc_hi/enc_lo slots -- see
// foc_sysid_step() telemetry section below.
// =============================================================================

static uint32_t pos_chirp_settle_tick  = 0;
static float    cl_pos_chirp_t         = 0.0f;
static float    cl_pos_chirp_angle_rad = 0.0f;

static void run_cl_pos_chirp(void)
{
    float theta = foc_theta_from_encoder();

    if (!current_feedback_sample_valid()) { return; }

    current_feedback_get_phase_amps(&ia_meas, &ib_meas, &ic_meas);
    current_feedback_get_dq(theta, &i_d_meas, &i_q_meas);

    vel_meas_counts = encoder_get_velocity();

    // ── Position loop — 1 kHz ────────────────────────────────────────────────
    if (++pos_loop_tick >= POS_LOOP_DECIMATE)
    {
        pos_loop_tick = 0;

        int32_t raw = encoder_get_position() - sysid_enc_offset;
        pos_meas_rad = (float)raw * (FOC_TWO_PI / ENCODER_CPR);

        if (pos_chirp_settle_tick < POSITION_STEP_SETTLE_TICKS)
        {
            pos_cmd_rad = 0.0f;
            ++pos_chirp_settle_tick;
        }
        else
        {
            sysid_f = CL_POS_CHIRP_F_START *
                      powf(CL_POS_CHIRP_F_END / CL_POS_CHIRP_F_START,
                           cl_pos_chirp_t / CL_POS_CHIRP_DURATION);

            cl_pos_chirp_angle_rad += FOC_TWO_PI * sysid_f * DT_POSITION;
            if (cl_pos_chirp_angle_rad >= FOC_TWO_PI)
                cl_pos_chirp_angle_rad -= FOC_TWO_PI;

            pos_cmd_rad = CL_POS_CHIRP_AMPLITUDE * cosf(cl_pos_chirp_angle_rad);

            cl_pos_chirp_t += DT_POSITION;

            if (cl_pos_chirp_t >= CL_POS_CHIRP_DURATION)
            {
                pos_cmd_rad     = 0.0f;
                vel_cmd_rad_sec = 0.0f;
                iq_cmd          = 0.0f;
                foc_vd_applied  = 0.0f;
                foc_vq_applied  = 0.0f;
                pwm_apply_dq(0.0f, 0.0f, theta);
                loops_reset();
                sysid_stage = SYSID_STAGE_IDLE;
                return;
            }
        }

        vel_cmd_rad_sec = p_step(&position_loop, pos_cmd_rad - pos_meas_rad);
        if (vel_cmd_rad_sec >  POSITION_VEL_LIMIT) vel_cmd_rad_sec =  POSITION_VEL_LIMIT;
        if (vel_cmd_rad_sec < -POSITION_VEL_LIMIT) vel_cmd_rad_sec = -POSITION_VEL_LIMIT;
    }

    // ── Velocity loop — 5 kHz ────────────────────────────────────────────────
    if (++vel_loop_tick >= VEL_LOOP_DECIMATE)
    {
        vel_loop_tick = 0;
        float vel_meas_rad = vel_meas_counts * (FOC_TWO_PI / ENCODER_CPR);
        iq_cmd = pi_step(&velocity_loop, vel_cmd_rad_sec - vel_meas_rad, DT_VELOCITY);
    }

    // ── Current loop — 20 kHz ────────────────────────────────────────────────
    foc_vd_applied = pi_step(&d_current_loop, 0.0f - i_d_meas, SYSID_DT);
    foc_vq_applied = pi_step(&current_loop, iq_cmd - i_q_meas, SYSID_DT);

    pwm_apply_dq(foc_vd_applied, foc_vq_applied, theta);
}


// =============================================================================
// run_cine_sweep — same closed position loop chirp as run_cl_pos_chirp(),
// sized for FILMING instead of analysis (see CINE_SWEEP_* in config.h: a
// slow 0.1-3Hz sweep that's actually visible as motion, not a measurement
// sweep). Structurally identical cascade, own state/parameters so it can be
// captured independently of the real analysis chirp.
//
// Telemetry: shares the SYSID_TEST_POSITION_STEP slot convention, same as
// run_cl_pos_chirp() -- see foc_sysid_step() telemetry section below.
// =============================================================================

static uint32_t cine_settle_tick   = 0;
static float    cine_sweep_t       = 0.0f;
static float    cine_sweep_angle   = 0.0f;

static void run_cine_sweep(void)
{
    float theta = foc_theta_from_encoder();

    if (!current_feedback_sample_valid()) { return; }

    current_feedback_get_phase_amps(&ia_meas, &ib_meas, &ic_meas);
    current_feedback_get_dq(theta, &i_d_meas, &i_q_meas);

    vel_meas_counts = encoder_get_velocity();

    // ── Position loop — 1 kHz ────────────────────────────────────────────────
    if (++pos_loop_tick >= POS_LOOP_DECIMATE)
    {
        pos_loop_tick = 0;

        int32_t raw = encoder_get_position() - sysid_enc_offset;
        pos_meas_rad = (float)raw * (FOC_TWO_PI / ENCODER_CPR);

        if (cine_settle_tick < POSITION_STEP_SETTLE_TICKS)
        {
            pos_cmd_rad = pos_meas_rad;
            ++cine_settle_tick;
        }
        else
        {
            sysid_f = CINE_SWEEP_F_START *
                      powf(CINE_SWEEP_F_END / CINE_SWEEP_F_START,
                           cine_sweep_t / CINE_SWEEP_DURATION);

            cine_sweep_angle += FOC_TWO_PI * sysid_f * DT_POSITION;
            if (cine_sweep_angle >= FOC_TWO_PI)
                cine_sweep_angle -= FOC_TWO_PI;

            pos_cmd_rad = CINE_SWEEP_AMPLITUDE * cosf(cine_sweep_angle);

            cine_sweep_t += DT_POSITION;

            if (cine_sweep_t >= CINE_SWEEP_DURATION)
            {
                pos_cmd_rad     = 0.0f;
                vel_cmd_rad_sec = 0.0f;
                iq_cmd          = 0.0f;
                foc_vd_applied  = 0.0f;
                foc_vq_applied  = 0.0f;
                pwm_apply_dq(0.0f, 0.0f, theta);
                loops_reset();
                sysid_stage = SYSID_STAGE_IDLE;
                return;
            }
        }

        vel_cmd_rad_sec = p_step(&position_loop, pos_cmd_rad - pos_meas_rad);
        if (vel_cmd_rad_sec >  POSITION_VEL_LIMIT) vel_cmd_rad_sec =  POSITION_VEL_LIMIT;
        if (vel_cmd_rad_sec < -POSITION_VEL_LIMIT) vel_cmd_rad_sec = -POSITION_VEL_LIMIT;
    }

    // ── Velocity loop — 5 kHz ────────────────────────────────────────────────
    if (++vel_loop_tick >= VEL_LOOP_DECIMATE)
    {
        vel_loop_tick = 0;
        float vel_meas_rad = vel_meas_counts * (FOC_TWO_PI / ENCODER_CPR);
        iq_cmd = pi_step(&velocity_loop, vel_cmd_rad_sec - vel_meas_rad, DT_VELOCITY);
    }

    // ── Current loop — 20 kHz ────────────────────────────────────────────────
    foc_vd_applied = pi_step(&d_current_loop, 0.0f - i_d_meas, SYSID_DT);
    foc_vq_applied = pi_step(&current_loop, iq_cmd - i_q_meas, SYSID_DT);

    pwm_apply_dq(foc_vd_applied, foc_vq_applied, theta);
}


