jnzim/stm32l476-baremetal-blinky/src/sysid/foc_sysid.c
// =============================================================================
// foc_sysid_step — called from TIM1_UP_TIM10_IRQHandler at 20 kHz
// =============================================================================
#define SYSID_ALIGN_REPEATS   10u
#define SYSID_ALIGN_TICKS     40000u   /* same hold time you already use */
#define SYSID_PERTURB_TICKS   500u    /* kick duration between repeats */
#define SYSID_PERTURB_VQ      0.3f    /* torque-axis kick, not d-axis */

static uint32_t sysid_align_repeat = 0u;
static uint32_t sysid_perturb_tick = 0u;
static uint32_t sysid_idle_tick = 0u;
static int32_t  sysid_align_log[SYSID_ALIGN_REPEATS];   /* <-- set breakpoint, read this array */

void foc_sysid_step(void)
{
    switch (sysid_stage)
    {
        case SYSID_STAGE_ALIGN:
        {
            if (sysid_align_tick < 20000u)
            {
                foc_vd_applied = V_ALIGN;
                foc_vq_applied = 0.0f;
                pwm_apply_dq(foc_vd_applied, foc_vq_applied, 0.0f);
                ++sysid_align_tick;
            }
            else
            {
                // Motor off -- let the real current that built up during the
                // align hold decay to actual zero through the winding's own
                // R/L before ever closing a loop around it, instead of
                // patching around a large real current the fresh controller
                // has never seen. tau = L/R ~= 1.25mH/1.59ohm ~= 0.79ms;
                // 2000 ticks (100ms) is well over 100 time constants.
                foc_vd_applied = 0.0f;
                foc_vq_applied = 0.0f;
                pwm_apply_dq(0.0f, 0.0f, 0.0f);

                if (++sysid_discharge_tick >= 2000u)
                {
                    sysid_enc_offset = encoder_get_position();
                    loops_reset();
                    sysid_stage      = SYSID_STAGE_RUN;
                }
            }
        }
        break;





        case SYSID_STAGE_RUN:
        {
            /* ADC stall watchdog -- current_feedback_sample_count() only
             * advances when ADC_IRQHandler actually services a JEOC event.
             * Telemetry showed this freezing for seconds at a time during
             * CL_VEL_CHIRP instability while the rest of this ISR (theta,
             * encoder, current loop) kept running fine. Trap right at the
             * point it goes stale so a live debugger halts with the fault
             * still present, instead of the freeze being over by the time
             * a human can react to it. Only meaningful with a debugger
             * attached -- an unhandled BKPT with no debugger will hard-fault.
             */
            #define ADC_STALL_WATCH_TICKS  100u   /* ~5ms @ 20kHz -- well past healthy ADC cadence */
            static uint32_t adc_stall_prev_count = 0xFFFFFFFFu;
            static uint32_t adc_stall_tick       = 0u;

            uint32_t adc_count_now = current_feedback_sample_count();
            if (adc_count_now == adc_stall_prev_count)
            {
                if (++adc_stall_tick >= ADC_STALL_WATCH_TICKS)
                {
                    //__BKPT(0);            /* <-- ADC_IRQn has stalled; halt here */
                    adc_stall_tick = 0u;  /* in case execution is resumed manually */
                }
            }
            else
            {
                adc_stall_tick = 0u;
            }
            adc_stall_prev_count = adc_count_now;

        #if   SYSID_TEST == SYSID_TEST_CURRENT_LOOP_CHIRP
            run_current_lp_chirp();
        #elif SYSID_TEST == SYSID_TEST_CURRENT_LOOP_STEP
            run_cl_current_step();
        #elif SYSID_TEST == SYSID_TEST_CL_CURRENT_CHIRP
            run_cl_current_chirp();
        #elif SYSID_TEST == SYSID_TEST_VEL_CHIRP
            run_vel_chirp();
        #elif SYSID_TEST == SYSID_TEST_CL_VEL_STEP
            run_cl_vel_step();
        #elif SYSID_TEST == RIPPLE_DEBUG
            run_cl_vel_step();
        #elif SYSID_TEST == SYSID_TEST_CL_VEL_CHIRP
            run_cl_vel_chirp();
        #elif SYSID_TEST == SYSID_TEST_POSITION_STEP
            run_position_step();
        #elif SYSID_TEST == SYSID_TEST_CL_POS_CHIRP
            run_cl_pos_chirp();
        #elif SYSID_TEST == SYSID_TEST_CINE_SWEEP
            run_cine_sweep();
        #endif
        }
        break;

        case SYSID_STAGE_IDLE:
        {
            foc_vd_applied = 0.0f;
            foc_vq_applied = 0.0f;
            pwm_apply_dq(0.0f, 0.0f, 0.0f);

            if (++sysid_idle_tick >= 80000)
            {
                sysid_align_tick = 0u;
                sysid_idle_tick = 0;

            }


        }
        break;
    }

    // -------------------------------------------------------------------------
    // Telemetry
    // -------------------------------------------------------------------------

    uint16_t flags = (uint16_t)sysid_stage;

#if SYSID_TEST == SYSID_TEST_CURRENT_LOOP_CHIRP
    float theta_telem = 0.0f;
#else
    float theta_telem = foc_theta_from_encoder();
#endif

    int32_t enc_pos = encoder_get_position();

#if SYSID_TEST == SYSID_TEST_CL_VEL_STEP

    /* Closed-loop velocity step:
     *   sysid_f slot -> velocity command [mrad/s]
     *   last slot    -> measured velocity [counts/s]
     */
    int16_t sysid_f_slot = (int16_t)(vel_cmd_rad_sec * 1000.0f);
    int16_t last_slot    = (int16_t)vel_meas_counts;

#elif SYSID_TEST == SYSID_TEST_CL_VEL_CHIRP

    /* Closed-loop velocity chirp:
     *   sysid_f slot -> velocity command [mrad/s]
     *   last slot    -> measured velocity [counts/s]
     *
     * sysid_f briefly carried raw ADC1->SR instead, while root-causing the
     * SPI DMA freeze (see spi.c EXTI15_10_IRQHandler) -- that's fixed now,
     * back to vel_cmd for real Bode/plant-ID captures.
     */
    int16_t sysid_f_slot = (int16_t)(vel_cmd_rad_sec * 1000.0f);
    int16_t last_slot    = (int16_t)vel_meas_counts;

#elif SYSID_TEST == RIPPLE_DEBUG

    /* Constant-iq ripple test:
     *   sysid_f slot -> actual iq command [mA]
     *   last slot    -> same measured velocity used by velocity controller
     */
    #define VEL_TELEM_DIV 8.0f
    int16_t sysid_f_slot = (int16_t)(iq_cmd * 1000.0f);
    int16_t last_slot = (int16_t)(vel_meas_counts / VEL_TELEM_DIV);

#elif SYSID_TEST == SYSID_TEST_POSITION_STEP || SYSID_TEST == SYSID_TEST_CL_POS_CHIRP || SYSID_TEST == SYSID_TEST_CINE_SWEEP

