jnzim/stm32l476-baremetal-blinky/src/sysid/foc_sysid.c
    /* Position step / closed position loop chirp / cine sweep:
     *   sysid_f slot -> position command [mrad]
     *   last slot    -> measured position [mrad]
     */
    int16_t sysid_f_slot = (int16_t)(pos_cmd_rad * 1000.0f);
    int16_t last_slot    = (int16_t)(pos_meas_rad * 1000.0f);

#elif SYSID_TEST == SYSID_TEST_CL_CURRENT_CHIRP

    /* Closed-loop current chirp:
     *   sysid_f slot -> current command [mA]
     *   last slot    -> measured current [mA] (mirrors i_q_meas, already
     *                   logged natively in iq_mA -- kept here too so the
     *                   Pi-side script can use the same H=last/sysid_f
     *                   pattern every other closed-loop chirp test uses)
     */
    int16_t sysid_f_slot = (int16_t)(iq_cmd * 1000.0f);
    int16_t last_slot    = (int16_t)(i_q_meas * 1000.0f);

#elif SYSID_TEST == SYSID_TEST_CURRENT_LOOP_STEP

    /* Current-loop step: sysid_f slot is otherwise unused by this test
     * (only the chirp tests touch it) -- repurposed to carry ic_mA so
     * all three phase currents (ia, ib, ic) are visible over time,
     * verifying ia+ib+ic ~= 0 continuously instead of at one instant. */
    int16_t sysid_f_slot = (int16_t)(ic_meas * 1000.0f);
    int16_t last_slot    = (int16_t)(iq_cmd * 1000.0f);

#elif SYSID_TEST == SYSID_TEST_VEL_CHIRP

    /* Open-loop velocity/mechanical-plant chirp:
     *   sysid_f slot -> chirp frequency [Hz]
     *   last slot    -> commanded current [mA]
     *
     * last slot briefly carried the ADC sample counter instead (diagnostic
     * for a stall theory that turned out not to apply here -- the P-only
     * current loop + tighter VEL_CHIRP_IQ_LIMIT fixed the real instability).
     * Reverted -- bode_vel_plot.py reads this column as iq_cmd_mA and uses
     * it as the coherence reference signal against theta; a monotonic
     * counter there has ~zero coherence with anything once detrended,
     * which silently broke the whole plant-ID fit (0 bins >= 0.5 coherence)
     * until this was caught.
     */
    int16_t sysid_f_slot = (int16_t)sysid_f;
    int16_t last_slot    = (int16_t)(iq_cmd * 1000.0f);

#else

    int16_t sysid_f_slot = (int16_t)sysid_f;
    int16_t last_slot    = (int16_t)(iq_cmd * 1000.0f);

#endif

    /* ALIGN-stage override, independent of SYSID_TEST -- carries RCC->CSR's
     * reset-cause flags (top byte: PORRSTF/BORRSTF/PINRSTF/SFTRSTF/
     * IWDGRSTF/WWDGRSTF/LPWRRSTF) so a brownout/reset during a violent
     * instability event shows up in the CSV directly, without needing the
     * debugger's register view (unreliable this session). g_reset_cause is
     * captured once at boot in main() and never cleared, so it accumulates
     * every reset cause since the last real power-cycle. */
    if (sysid_stage == SYSID_STAGE_ALIGN)
    {
        extern volatile uint32_t g_reset_cause;
        sysid_f_slot = (int16_t)((g_reset_cause >> 16) & 0xFFFFu);
    }

    /* enc_hi/enc_lo normally carry the raw 32-bit encoder position. For the
     * position-loop tests that's fully redundant with pos_meas_rad above (same
     * encoder count, just rescaled), so those two slots are repurposed to
     * carry the velocity profile instead -- vel_cmd_rad_sec (the position
     * P controller's output) and the raw measured velocity, same units/scale
     * SYSID_TEST_CL_VEL_STEP/CHIRP already use. */
#if SYSID_TEST == SYSID_TEST_POSITION_STEP || SYSID_TEST == SYSID_TEST_CL_POS_CHIRP || SYSID_TEST == SYSID_TEST_CINE_SWEEP
    int16_t enc_hi_slot = (int16_t)(vel_cmd_rad_sec * 1000.0f);   /* vel_cmd  [mrad/s]   */
    int16_t enc_lo_slot = (int16_t)vel_meas_counts;                /* vel_meas [counts/s] */
#elif SYSID_TEST == SYSID_TEST_CL_VEL_CHIRP
    /* enc_hi repurposed to carry the velocity controller's own output
     * (iq_cmd, what it's actually asking the current loop for) -- not
     * previously visible in telemetry at all for this test, only the
     * current loop's resulting id/iq and vd/vq were. enc_lo repurposed to
     * carry the ADC injected-conversion sample counter (low 16 bits) --
     * ia/ib were seen to freeze bit-identical for ~13 consecutive ticks
     * during an instability event while theta (a different peripheral) kept
     * updating normally, suggesting ADC_IRQHandler stalls. This counter only
     * advances when that ISR actually fires, so a flat run of samples here
     * directly proves/disproves the stall instead of inferring it. */
    int16_t enc_hi_slot = (int16_t)(iq_cmd * 1000.0f);             /* iq_cmd   [mA]       */
    int16_t enc_lo_slot = (int16_t)(current_feedback_sample_count() & 0xFFFFu); /* ADC IRQ counter */
#else
    int16_t enc_hi_slot = (int16_t)(enc_pos >> 16);
    int16_t enc_lo_slot = (int16_t)(enc_pos & 0xFFFF);
#endif

    spi_sysid_update_latest(
        enc_hi_slot,                             /* enc_hi  OR vel_cmd mrad/s      */
        enc_lo_slot,                             /* enc_lo  OR vel_meas counts/s   */
        sysid_f_slot,                           /* sysid_f_Hz  OR vel_cmd mrad/s  */
        (int16_t)(i_d_meas * 1000.0f),          /* id_mA          */
        (int16_t)(i_q_meas * 1000.0f),          /* iq_mA          */
        (int16_t)(foc_vd_applied * 1000.0f),    /* vd_mV          */
        (int16_t)(foc_vq_applied * 1000.0f),    /* vq_mV          */
        (int16_t)(theta_telem * 1000.0f),       /* theta_mrad     */
        (int16_t)(ia_meas * 1000.0f),           /* ia_mA          */
        (int16_t)(ib_meas * 1000.0f),           /* ib_mA          */
        last_slot,                               /* iq_cmd_mA  OR vel_meas counts/s */
        flags,
        (uint16_t)SYSID_TEST                     /* which test is compiled in, for the Pi's script dispatch */
    );
}


// =============================================================================
// foc_sysid_reset — call on fault recovery or re-enable
// =============================================================================

void foc_sysid_reset(void)
{
    sysid_stage      = SYSID_STAGE_ALIGN;
    sysid_align_tick     = 0;
    sysid_discharge_tick = 0;
    sysid_enc_offset = 0;

    sysid_t         = 0.0f;
    chirp_angle_rad = 0.0f;
    sysid_f         = SYSID_F_START;

    cl_step_phase = CL_STEP_SETTLE;
    cl_step_tick  = 0;

    iq_cmd          = 0.0f;
    foc_vd_applied  = 0.0f;
    foc_vq_applied  = 0.0f;
    vel_cmd_rad_sec = 0.0f;
    vel_meas_counts = 0.0f;
    vel_loop_tick   = 0u;

    ia_meas  = ib_meas = ic_meas = 0.0f;
    i_d_meas = i_q_meas = 0.0f;

    vel_chirp_settle_tick   = 0u;

    cl_current_chirp_t         = 0.0f;
    cl_current_chirp_angle_rad = 0.0f;

    pos_chirp_settle_tick  = 0u;
    cl_pos_chirp_t         = 0.0f;
    cl_pos_chirp_angle_rad = 0.0f;

    cine_settle_tick = 0u;
    cine_sweep_t     = 0.0f;
    cine_sweep_angle = 0.0f;
}